#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "49978908e7c4364e580dd37af83d5181" -> "216d060c2c0a074ca328eb6b48b0cc93"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "054a88b0d263dd02626a8676a8039abd" -> "e4b6d3ae0f8c99a9ad4f9cd2f2681336"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "6bfb6bf716cf80c3dd61f104231049ee" -> "e310285877a28dc19e86c730208973be"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d625b5c257d75e28e9ab69d87fcc0f07" -> "d39daf3c17dd9c7053de0c0d2c14b298"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "28158ecad87bcdf2071c69aa2c8e9f13" -> "33eec6318cab0de5fb349d4e988c6bca"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "b173331fc19bd14e36481bd110ec1222" -> "5c483f43aab85fb672538b2d056da0e3"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "1a0ecdf7b71337268ee6bd352d0965f0" -> "0425961b4a71280a30b69aa5b6e55a49"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "064daf03a7d617eeb98078d5f3a219df" -> "352c586fa09c9dfa31236ad90c637353"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "082886d91dd2164163d0206b5b9cc20b" -> "02f4dc56ec6a928e40ef7d5524b71acb"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "aa9a3c3245207c14cb5be666ce9950d3" -> "c8d32315d97321bc739399683b1d0d37"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "e11423f755b5190a8c875539ff3f9208" -> "22ecbcb4c4a3535500d3090c24e93022"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "de6d287628c8381d43ceba60d2b1ea02" -> "91f78195b64e3bd7e7fd173c34ba8c48"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "67110c33d998a8d32578d4e44e8273cc" -> "39594bddbc6da6d771d81ae49c71f34d"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "740b600363ed80c46301fea92149fde0" -> "1f04db828e2b102c6206c24402459910"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "1e1aff9e42d64bf37484a2835a4a28cf" -> "84e0a1d5bce15a55de210bb482d64a26"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "77762a290f44ecf7a9bff749a0197356" -> "412f4af43139413c1856fd195a2fd878"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "e0d2350b480c9f2e49d013e3ee4f3483" -> "86f37b4ea6bd250b99bdc643549739c9"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "5e289b854b8ae4c9bc88e07d8efd895c" -> "31cd0f1df3c95ba8470feaec9656ea43"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "acd22d8b10dc2629cff3ac0b145f85a6" -> "398e3c203b0696602c1b4945bc75fcee"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "5044f2ddf99a1f58f60b7b2e5044b07f" -> "e9a8afef1b1f273cb21a2a4263f43d07"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "f399f3ec7c9f86082f221cfc51d78f02" -> "fccecc096786c1eb28c22710db32b4d4"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "53fb5af303c7555d37af81baa1e77719" -> "1e2e37877484e66c3acaa646960e2dd9"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "dd0301ac1f7be65e2a22ccaabe2769fc" -> "5fa7049e208942cd1332851edb38f4ef"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "effac2b751a22bd2d98af05073197cc1" -> "2216d28c8c83d4051b8dd8408ac2ea14"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "8ea237401d3e201996cd2934acf6689b" -> "a8ee65d4b34ba999dd41d211ce342b95"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "3b76466691b2bebd8c4347d74f39a74e" -> "9389287d4247c5d9201e05791b090f2e"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "f2c91ab053701a15b21056cb5def442c" -> "947bd942be13bbea3ea539ed59f8bc7a"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "b2ef4a8b899c4df6066fa4e10c4fe49f" -> "400010f7b22ebc11ecca19d1bdac344a"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "7658352201ffbf6afbfc6f44f0a3e83d" -> "040206426d5a0a266e22524104dfe7e7"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "4f1e11549163dfc49ae8d403032f3458" -> "71d9e96206a9cbac64fd853d5fa6a4a2"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e2fb7229cc789166e5832dfca4473915" -> "aa1cdec61231f041a07c48db4b2acda9"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "ea57270fefbc31f295de9c5f2f19478d" -> "64ca7c29c83b869efef5128603f4aa29"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "e6a546f3a64cf1b8a5663eb5423ac6ce" -> "7e60f6b620561220647677348908ed17"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "626de23d4632ab80b007e6dcb9bc10ab" -> "8d70c5d6b67dd3b35e7134ad4eb2984e"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7f77ca41d8b24a5932853e5aa1d45c3d" -> "4920db05ce15098c33db531caf7c953e"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "972a6a938dd7cbe4bf5e1b3f541c6bb9" -> "dc7ba59f0cfe70a57ecce1092d9381ff"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "cad73ba83e9a69389886f66c585d5aea" -> "f0236944a6a85641a932acf5b4f335df"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "fb3b34e72d12a643733f33ae12f3444c" -> "36475bb1d985ac50386cdd5065ab0a52"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "63adc3dfcbbb8d80e3c5ca9cced34179" -> "38a40f8511b7a28e2e19d48074fb8ffa"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "cc83de0fa4bebf831cf4a4ae467282d4" -> "9e1eab9c39012b4b06b015cf0039abdb"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "2d630ef4063fa3d73a18502e29850cd5" -> "632ac64df277c9da59a36a515aa6786a"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "cab697472f30fc827ca1996e3a415880" -> "0eaf982fc11c229a6670119665383502"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "ee892eca0a622d9c865a63bd204ab307" -> "cb3ed50255daf33ee753c16b4e367d90"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "84902a6e09f5f1d9cf9d1dc517e8a157" -> "c1c895f8a277bf58fc9c6ce5c21bfe3b"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "3616fb2b9669bcf3fbf461f08e48ec1f" -> "1e22ff0bfe7f64f838e6402dbfd19b28"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "528f10818b49539a944476d01e4c54d0" -> "480509ceb22f93096d9feed29222c9e4"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "e2b3511b39a74c5c70ae19a1fda0ac34" -> "cd62bf29ea42ceb672713cf0f683ea96"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "I7vo+jTRb6BCbKMUiyTK+DuFs9zxgWfGrbad79hzuRE=" -> "EHHsvzuS81uQyG0qAxl07Ie91h8x3HVWuPBZpQmtQNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "AbjR8/5hiWNs6PVWzYVJhbNZYf2rshrMOHm/RY+jiko=" -> "WZbEco6hsvq03SbFkNNfD2pLGX3Gg4qAuiebaq0kf74="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "ogbTPZS4lEQ+7wTuvf+Uvhl8Ol78+ntCbYWRXHWA7h8=" -> "J5xe/vtA62pM0Plxe09usKnwNLxQI45NdiEKGiIlFPQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "yFf89J3AhTHCmlvZHnUj2Q8NSBr5aWUlLyoR6PkazuU=" -> "ICUy9nigKOXpgJ9KISEQZmXI5eBcr/4rwyXy3hjFddA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "3hrVyF67Vd8LktP9WXlhjATkdEPKfgRRoxBnj9MxRKk=" -> "GV89PJ3bzoJvM8oMW+MTn2bY7cYOn/4szxw3QPgnF7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDOQjHXM0AaOTBGPKwBlxgtG7SetR3P8LAmWx2D4sLA=" -> "Jfre/imN23Cgrev+hGe8TWVyo0hGpsJ8ayVjoP+fayo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "F+Qb0efzVtk32umzT+X5IfcoayqGDhxxYCFL9eqYC0s=" -> "6CUrQuSi670XVVe2fkQORgHLIBKC2q/2/wk6HbzqsCo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "KNMQfz0DRyjNfvO2NKsXVDfYguqnawjNK8OQB+ZH9kQ=" -> "AI8cpAlZvjyQujYilwHm8RxD+oMKLhHxpR3R/bHp3p4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "uebFC8Y4/K7eFFUd/zW48S2U6hYnKTVBQY6e4YtVr1M=" -> "5T59Tg0/lxlLu6mJtfSPaEUX/0vwbhPTOnuRB6O34VE="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "oijQS2GWzk/Jqz9WUnfAYLAqC8H77t3TiWrvxDKXysI=" -> "rPDEufYVZfmcBfQkAVSQ5FqT6GMjTzpocYDFCQOGTew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "zWINWU1K8P9ZcfdZ9L4kAWAGs+mkvSAPXTKx/9vwuoY=" -> "LxW08lXi9h92kL9sscTnmVE7btqpZCzQ06+94dAg+CI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "r9embf8SeSPTLEGxbxfv9FZ2Wnxbf4T9xy3GxMpPjFs=" -> "GP3D9FdBK1wIwt5s/isHNcqb48cUSi2Y3Bbm6RJrm8g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "0h7UqGBMOAn40vZRwrVWYvFdcilGWPaBh4+ZmX08Pls=" -> "Nc08hR6+0jvlybmk/Rl1PNjAOTGMbYkS6r9ctAjOe50="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "usxalsFxE2EJa6ZGxLXdbifnFuYDd+fBTNzxRU5EVpE=" -> "9S85MIlGmoYVGijPMMOrWL1PIOv+uwJWPyb6k8ev7xk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "xxqKDCGNE4FS6e6YfAO73dlwKMeqaIbmrXNLc6utRYw=" -> "UwfFTVkDFqFOh6GMOeCMtTgYyZGUuSwnf77VrncUNZA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "8S2/G9/nCjy5xbLwvOe53gX74hfySHOuSnEJRQWfelI=" -> "f1wv/0w+cLNOv4gCTFYi39vPjo+rsDZdTIj0qjR1Yx8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgLfBUXRiw6Z9snqc3rVgIAqVZbbLaiye7bvT3TVsf8=" -> "ppj4ZmVSBtm09gwgC1q4fOQs361ydNr4rjiRX3bbAK8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "vdmF9SNMwepfX3WbpZHqfJIlKNncpi9/8aDVYZci8Ng=" -> "vOaJCnHXiVePR8/PlVtVVN4698fJRcZ2MmV60m17AJY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:48.000+0000" -> (known after apply)
      ~ source_code_hash               = "Q7ovP7QW+FZNeUOXENZEc2hlah2LMXrREwkpniwy17E=" -> "5ifcWcaXwswH6jbhybrA+RKN2Rx0D0RC4sHiyjs1ziE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "/fj2hupGCYPggRAHam7fOlB8NhAgBHs3nYHb/rFThBg=" -> "739TYMfAAPHhXIZNjd589uzgH28JeOgBVDvdK1Uyy30="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "YJEmcJtirN+DFDKmfCrdLluS2G7wADCNvC3sGtMF78Q=" -> "n4c3mCGU9WlfJ+FD+ZzIWkJ7stMwfr8+8JpCQErwYx0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "FR+4PNL1cdoahVEDbbKNYggPBPJVF+FuZ/vWiX1wXUs=" -> "Apiq/KRM/xFn76+jlR5JV9mOZsJznIxb+VBInlBFElU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "AzcGwYTqYaYK7J1SH6IGQ3rD7FnxRsAAgcEuyRkvgI0=" -> "9hh37Rz8R1Mim2P009/B5VJv+jsbcEt3iYm8X4PiwLk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "yODY9zTLRxFH9/SZG/eed8IshboWD/pK0r/Nsj4rXCw=" -> "IXQF/Lx1mD7azmTJCbcja5/Y4iO1+vFeYdtgldq0M4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "UV8NuV5j9GE/yz2aMTwIwyWinCIBLCbRDjExUsNkx70=" -> "6afVx+z6fPs3W1dLFdzW20iv0L6Ac6uNto7+X7n0xMo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "y2N05WJwh2zaGyxb/8JJHubRAQvCmWpny5NrKT84T54=" -> "Ibu1QnOH39oF0VL+CLdpQWZBGcfwzip3I2uRpAeRk7o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Hde0chkVPzhGUTdW7OIfzM77rBB4ZAjab5i2xJZuVI=" -> "U0U8x1GH1ptKE6TsxjvVzDNXxZylhIiSZR/JVF+Uwr0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "znH14WJuN5LSCJ+kACI+6nr0ebcIeVF9IptEn4Fxs5c=" -> "amd+PLQrMf1j207DsyKC3hCPjdprQ0Af69NvKZq957k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "E3T7H9+zyHVlc7Qo9FVzRJfLB4t0wkMM9yKeiJlgoJE=" -> "YW0ZvwYKZH+TgddBz9UDAhRKw0ky7Dw3EDKO4JSPAw0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "G5NvU0N9zNfuHpRjsZcOlJME+ZKjQonL9aanGqlX8tE=" -> "va8yAYpdG2Me83+lMqXNlXMWe2B5/h43Go1gl6MoeQY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-14T22:49:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "jhxjd6BAFCTXVZT6ChlOhyDCtLPuPcI1SIDewxFYdps=" -> "HYMGNqdorPcootVMNSBoAHHL4NlNVdT1CoUXIAJ6GGA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "Prtn8+O/GqRk7XHgXMR/YXqMv+3brI9ZZ1VU1dAweaI=" -> "zyiZ009eUMVo5I6Pq9h90KSrSR0imnSXWRcQwUf7xrI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "z3hTUThwvxGgCV674FEs+qKK+lbDiEjqF6rJgr1scXQ=" -> "DTmK7eyqNJTnHYt8sm4JYY+ItDOhuCmrOG/x8XJmosU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "6u5B3O1/muZLul8YsXeDFRcG+9ipyWXf6x58d9GGD/0=" -> "PCzLssehkYgC3xssaIKbe5fKqZFVRB23lVE7d9Vm1ps="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "SENwF1tJx2hGshJ8+RBm/Y9qTIifxQOh/xSVrWH3dw4=" -> "QHpwx6sTgpvdgd25/nmbxbZdYjcHoS8UbqiD57V2Ppc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "2hQc7B8chDahO1FO82rnJGdKGjJ1UIaZYlL7cSLRgLM=" -> "twASxSyn694a18PWELhzTctZ9+2632nB6VlPosj0KzE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZWSJlb3s50Dr+bwlc40cWaZ59aQzDyTIHBJlNbSwe/4=" -> "V2vEfWTsCMMFCR3U6+2UkYUkzhJjNVsOlccDg4fHqYo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "DcCkhnt4oLE4F2M7KeFvd/jo6+78TTQZXiyBBdooSnY=" -> "OurALxUaxZ2Mj+y5r6iDhVlOS6jlv8vp5HYcV6gIDlk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "NW1heEXbJ1OI9sWpPbvW7fFz8U//l7MLJV3jE9rHmss=" -> "DEtTuUtoAAX9NNBZ1ykD7igsIFFEb5ajlTi+oNDILXg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "k6YdB6//Bazrpepto6TekOmQlTjUhKA3V80xIdeOcgw=" -> "4sk/yeNBkgQrHEZCEKgwQaLAfgkBOb5wSzaumPYr6R4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "CJG4oaEP4lTzztQ2ee0P0AahjjSs4MGtN3HXwRiz+Mk=" -> "0/Ttv9vVm7i+0XwvsiTeBQ7U2VO14F8M4Uddflg3Tig="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "BodYvOnXHO8WponQvzii7V/awIKBf9a5eMkCl738HAw=" -> "EXDECDhMNd1Rizi8kxKYqiSmJ5FKtv52ECGpYjdowJ0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "8fFHsQFtkVE3YZMVThsDIku5ISKpKe0WIDaofALWs0I=" -> "l3KZd0Rfss2OF+wgeJ+Ibi4Z8vmuggIDpDS8X77RETY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:47.000+0000" -> (known after apply)
      ~ source_code_hash               = "g9aNvE7Xap0zWywBDE2FhCFuAueKDN8z1/RFFO9D+ro=" -> "muiwTW2xAIx7+xvRelwGX9IWlYuBG0j2sCmQFdbT2cw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "aotxLo1S+WGUpeI8AyvjmUIkV1ldjc6+Kh/fqWjSY8U=" -> "UjIIjo1fjUYMN/J6p7YPtzeAojVa06OCXJ5+c5KbgGg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-13T05:04:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "dh4axu8yUAmyi+QOo5meAF2PXYYYlvQciCNNSWWX9OU=" -> "8agCnIGRU7NQxED9E7j2BSabZGDgtlNUt+MJ+S3RF1E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-13T05:03:45Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "nkvkm6" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-13T05:03:44Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-13T05:03:42Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*